export type WarehouseKeys = "ФРЦ БРИЗ Шереметьево" | "МОС БРИЗ Медведково" | "МОС БРИЗ Саларьево" | "МОС БРИЗ Рязанское" | 
"ДРЦ БРИЗ Софьино" | "РРЦ Бриз Екатеринбург LV" | "РРЦ Бриз Ростов LV" | "РРЦ Бриз Новосибирск LV"| "РРЦ Бриз Самара LV" |
"РРЦ Бриз Краснодар LV"

export type LocationKeys = "Разгрузка" | "Ячейка"

export const DOCUMENT_PREFIXES = {
    warehouses: {
        "ФРЦ БРИЗ Шереметьево": "K",
        "МОС БРИЗ Медведково": "П",
        "МОС БРИЗ Саларьево": "С",
        "МОС БРИЗ Рязанское": "СТ",
        "ДРЦ БРИЗ Софьино": "C",
        "РРЦ Бриз Екатеринбург LV": "Е",
        "РРЦ Бриз Ростов LV": "Р",
        "РРЦ Бриз Новосибирск LV": "Н",
        "РРЦ Бриз Самара LV": "СМР",
        "РРЦ Бриз Краснодар LV": "КД"
    } as Record<WarehouseKeys, string>,
    locations: {
        "Разгрузка": "ПР",
        "Ячейка": "СК",
    } as Record<LocationKeys, string>
} as const
